#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# @trojanzhex


class Script(object):

    START_MSG = """<b>مرحبًا. {},

يمكنني استخراج الصوت والترجمة من ملفات الفيديو.

أرسل لي أي ملف فيديو واستخرج ما تريد.


© @IIIlIIv</b>"""


    HELP_MSG = """<b>ياخي اتبع الخطوات..</b>

🌀 <i>أرسل لي أي ملف فيديو</i>

🌀 <i>انقر فوق الزر "تنزيل ومعالجة" لتنزيل الملف على الخادم الخاص بي</i>

🌀 <i>Wait till I process the video!</i>

🌀 <i>الآن حدد الصوت الذي تريد استخراجه!</i>

<b>© @IIIlIIv</b>"""


    ABOUT_MSG = """- <b>اسمي Jimmy</b>

- <b>صنع وبرمجه :</b> @IIIlIIv    

- <b>بأستخدام لغة :</b> <code>بايثون</code>

- <b>مكتبة :</b> <a href='https://docs.pyrogram.org/'>البيروجرام 1.0.7</a> 

"""
